app/views/home/new_rsvp.html.haml

SELECT "guests".* FROM "guests"  WHERE "guests"."rsvp_id" = ?  [["rsvp_id", 4]]
---
=form_for @rsvp, url: update_rsvp_path do
  -@rsvp.guests.each do |guest|