app/controllers/home_controller.rb

SELECT  "rsvps".* FROM "rsvps"  WHERE "rsvps"."rsvp_code" = 'kylemorgan1' LIMIT 1
---
  def check_rsvp_code
    @rsvp = Rsvp.find_by(rsvp_code: params[:rsvp_code])

SELECT  "rsvps".* FROM "rsvps"  WHERE "rsvps"."rsvp_code" = 'kylemorgan1' LIMIT 1
SELECT "guests".* FROM "guests"  WHERE "guests"."rsvp_id" = ? AND "guests"."id" IN (1)  [["rsvp_id", 1]]
---
  def update_rsvp
    rsvp = Rsvp.find_by(rsvp_code: session[:rsvp_code])
    rsvp.update_attributes(rsvp_attributes)
    rsvp.guests.each do |guest|